import random

print('Игра "Отгадайка".\n Я загадаю слово, а ты будешь его угадывать.\n \
Я скажу тебе, сколько букв в этом слове. \n \
И еще ты можешь 5 раз узнать у меня, есть ли какая-либо буква в этом слове.')
words = ('сосиска',
         'крокодил',
         'медведь',
         'завтрак',
         'компьютер')
word = random.choice(words)
print('В этом слове', len(word), 'букв')
print('Теперь ты можешь 5 раз спросить меня, есть ли какая-то буква в этом слове?\n')
for i in range (5):
    symb = input('Напиши букву, которую хочешь проверить?')
    if symb in word:
        print('Да')
    else:
        print('Нет')
attempt = input('Какое слово было загадано?\n')
if attempt == word:
    print('Ура, ты угадал!')
else:
    print('Нет, попробуй в другой раз')
